In [1]:
#Add the pandas
#Add the numpy
import pandas as pd
import numpy as np

In [2]:
#then bring over the csv file
superheroes = pd.read_csv("SuperheroData.csv", parse_dates = ["FIRST_YEAR"])

In [3]:
#Let's see how many characters there are in total
print("Total Number of Characters:" + " " + str(len(superheroes)))

Total Number of Characters: 23420

In [4]:
#Let's explore the file a bit...can we find out how many characters are heroes, villans, or others?
character_count = superheroes["ALIGN"].value_counts()
print("List of character alignments:")
character_count

List of character alignments:

Bad                   9616
Good                  7584
ND                    3437
Neutral               2779
Reformed Criminals       3
Name: ALIGN, dtype: int64

In [5]:
#Let's also see how many female characters there are
female_count = superheroes.drop(superheroes[superheroes.SEX != "Female"].index)
print("Total Number of Female Characters:" + " " + str(len(female_count)))

Total Number of Female Characters: 5853

In [6]:
#So there's only 5853 female characters out of 23,420 characters total. 
#I wonder how many of them don't have data listed for their sex
sex_NDcount = superheroes.drop(superheroes[superheroes.SEX != "ND"].index)
print("Total Number of Characters without SEX identified:" + " " + str(len(sex_NDcount)))

Total Number of Characters without SEX identified: 978

In [7]:
#So only 978 characters where we do not have data on their sex. 
#Let's find out more about the different sexes of our characters
sex_count = superheroes["SEX"].value_counts()
print("Total Number of Characters:" + " " + str(len(superheroes)))
print("Breakdown of Characters by Sex:")
sex_count

Total Number of Characters: 23420
Breakdown of Characters by Sex:

Male           16521
Female          5853
ND               978
Agender           45
Genderless        20
Genderfluid        2
Transgender        1
Name: SEX, dtype: int64

In [8]:
#Okay, let's try some more things to get stuff out of this data
#Can I see the breakdown between the sex of a character and their alignment?
align_by_sex = pd.crosstab(superheroes["SEX"], superheroes["ALIGN"])
align_by_sex

ALIGN         Bad  Good    ND  Neutral  Reformed Criminals
SEX
Agender        20    10     2       13                   0
Female       1573  2528   913      837                   1
Genderfluid     0     1     0        1                   0
Genderless     11     6     0        3                   0
Male         7562  4888  2265     1804                   2
ND            449   151   257      121                   0
Transgender     1     0     0        0                   0

In [9]:
#cool cool cool, let's get a little deeper and get rid of the ND points
align_NDless = superheroes.drop(superheroes[superheroes.ALIGN == "ND"].index)
align_sex_NDless = align_NDless.drop(align_NDless[align_NDless.SEX == "ND"].index)
align_by_sex_NDless = pd.crosstab(align_sex_NDless["SEX"], align_sex_NDless["ALIGN"])
align_by_sex_NDless

ALIGN         Bad  Good  Neutral  Reformed Criminals
SEX
Agender        20    10       13                   0
Female       1573  2528      837                   1
Genderfluid     0     1        1                   0
Genderless     11     6        3                   0
Male         7562  4888     1804                   2
Transgender     1     0        0                   0

In [10]:
#I also want to see what month had the most first appearances by female characters
#Let's first narrow down the characters to just females
females_only = superheroes.drop(superheroes[superheroes.SEX != "Female"].index)
#I also want to get rid of the NDs in the months, so let's do that next.
#I'm going to use the same 'females_only' file so I can continue to use it later on
fem_firstmonth_NDless = females_only.drop(females_only[females_only.FIRST_MONTH == "ND"].index)
#Great! Now let's make a crosstab
females_by_firstmonth = pd.crosstab(fem_firstmonth_NDless["FIRST_MONTH"], ["SEX"])
#I also want to sort the file before the output so that the highest number is first
females_by_firstmonth.sort_values(['SEX'], ascending = False, inplace = True)
females_by_firstmonth.columns = ["Females Only"]

females_by_firstmonth

             Females Only
FIRST_MONTH
August                540
September             517
December              507
October               493
November              482
June                  481
January               464
July                  457
February              437
March                 414
May                   401
April                 380
Holiday                 1

In [11]:
#Well, let's get into finding what year had the most female character appearances
#First, I'm going to remove the NDs from the FIRST_YEAR key. Let's use our previous filtered dataframe
fem_firstmonth_year_NDless = fem_firstmonth_NDless.drop(fem_firstmonth_NDless[fem_firstmonth_NDless.FIRST_YEAR == "ND"].index)
aug_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "August"].index)
aug_femfirstmonth_year = pd.crosstab(index = aug_femfirstmonth_year["FIRST_YEAR"], columns = aug_femfirstmonth_year["FIRST_MONTH"])
aug_femfirstmonth_year.sort_values(['August'], ascending = False, inplace = True)
#Let me tell you how long those two lines of code above took to figure out.
#Finally, I just decided to drop all the other months and sort it that way to get what I needed. 
aug_femfirstmonth_year.head()

FIRST_MONTH  August
FIRST_YEAR
2010             34
1997             27
2009             25
2011             23
2004             21

In [12]:
#We're just gonna keep going down the line of months from most female characters to least and see where it gets us
sept_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "September"].index)
sept_femfirstmonth_year = pd.crosstab(index = sept_femfirstmonth_year["FIRST_YEAR"], columns = sept_femfirstmonth_year["FIRST_MONTH"])
sept_femfirstmonth_year.sort_values(['September'], ascending = False, inplace = True)

sept_femfirstmonth_year.head()

FIRST_MONTH  September
FIRST_YEAR
2006                34
1996                28
1994                21
1988                20
2007                18

In [13]:
dec_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "December"].index)
dec_femfirstmonth_year = pd.crosstab(index = dec_femfirstmonth_year["FIRST_YEAR"], columns = dec_femfirstmonth_year["FIRST_MONTH"])
dec_femfirstmonth_year.sort_values(['December'], ascending = False, inplace = True)

dec_femfirstmonth_year.head()

FIRST_MONTH  December
FIRST_YEAR
1987               25
1989               21
1993               21
2001               20
2010               19

In [14]:
oct_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "October"].index)
oct_femfirstmonth_year = pd.crosstab(index = oct_femfirstmonth_year["FIRST_YEAR"], columns = oct_femfirstmonth_year["FIRST_MONTH"])
oct_femfirstmonth_year.sort_values(['October'], ascending = False, inplace = True)

oct_femfirstmonth_year.head()

FIRST_MONTH  October
FIRST_YEAR
2009              28
1988              28
1994              21
2010              19
2006              19

In [15]:
nov_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "November"].index)
nov_femfirstmonth_year = pd.crosstab(index = nov_femfirstmonth_year["FIRST_YEAR"], columns = nov_femfirstmonth_year["FIRST_MONTH"])
nov_femfirstmonth_year.sort_values(['November'], ascending = False, inplace = True)

nov_femfirstmonth_year.head()

FIRST_MONTH  November
FIRST_YEAR
1996               23
2010               23
2005               19
2008               18
1994               18

In [16]:
june_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "June"].index)
june_femfirstmonth_year = pd.crosstab(index = june_femfirstmonth_year["FIRST_YEAR"], columns = june_femfirstmonth_year["FIRST_MONTH"])
june_femfirstmonth_year.sort_values(['June'], ascending = False, inplace = True)

june_femfirstmonth_year.head()

FIRST_MONTH  June
FIRST_YEAR
1992           26
1993           24
1989           20
2005           19
2006           18

In [17]:
jan_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "January"].index)
jan_femfirstmonth_year = pd.crosstab(index = jan_femfirstmonth_year["FIRST_YEAR"], columns = jan_femfirstmonth_year["FIRST_MONTH"])
jan_femfirstmonth_year.sort_values(['January'], ascending = False, inplace = True)

jan_femfirstmonth_year.head()

FIRST_MONTH  January
FIRST_YEAR
2011              27
2006              25
1994              25
2008              24
1989              16

In [18]:
july_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "July"].index)
july_femfirstmonth_year = pd.crosstab(index = july_femfirstmonth_year["FIRST_YEAR"], columns = july_femfirstmonth_year["FIRST_MONTH"])
july_femfirstmonth_year.sort_values(['July'], ascending = False, inplace = True)

july_femfirstmonth_year.head()

FIRST_MONTH  July
FIRST_YEAR
2003           26
2008           22
2004           22
1992           21
1998           17

In [19]:
feb_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "February"].index)
feb_femfirstmonth_year = pd.crosstab(index = feb_femfirstmonth_year["FIRST_YEAR"], columns = feb_femfirstmonth_year["FIRST_MONTH"])
feb_femfirstmonth_year.sort_values(['February'], ascending = False, inplace = True)

feb_femfirstmonth_year.head()

FIRST_MONTH  February
FIRST_YEAR
1996               21
1987               19
2006               16
2011               15
2010               15

In [20]:
mar_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "March"].index)
mar_femfirstmonth_year = pd.crosstab(index = mar_femfirstmonth_year["FIRST_YEAR"], columns = mar_femfirstmonth_year["FIRST_MONTH"])
mar_femfirstmonth_year.sort_values(['March'], ascending = False, inplace = True)

mar_femfirstmonth_year.head()

FIRST_MONTH  March
FIRST_YEAR
1993            19
1994            17
1986            16
1999            16
2000            15

In [21]:
may_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "May"].index)
may_femfirstmonth_year = pd.crosstab(index = may_femfirstmonth_year["FIRST_YEAR"], columns = may_femfirstmonth_year["FIRST_MONTH"])
may_femfirstmonth_year.sort_values(['May'], ascending = False, inplace = True)

may_femfirstmonth_year.head()

FIRST_MONTH  May
FIRST_YEAR
1990          22
2006          20
2005          20
1993          16
2010          14

In [22]:
apr_femfirstmonth_year = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_MONTH != "April"].index)
apr_femfirstmonth_year = pd.crosstab(index = apr_femfirstmonth_year["FIRST_YEAR"], columns = apr_femfirstmonth_year["FIRST_MONTH"])
apr_femfirstmonth_year.sort_values(['April'], ascending = False, inplace = True)

apr_femfirstmonth_year.head()

FIRST_MONTH  April
FIRST_YEAR
2005            20
1996            16
1993            14
1997            12
1988            12

In [23]:
#So we've broken down the highest first appearances of a female character by month and by year within a month.
#Let's backtrack and see which years had the highest female first appearances overall
fem_firstyear = pd.crosstab(index = fem_firstmonth_year_NDless["FIRST_YEAR"], columns = fem_firstmonth_year_NDless["SEX"])
fem_firstyear.sort_values(["Female"], ascending = False, inplace = True)
fem_firstyear.columns = ["Females Only"]

fem_firstyear.head()

            Females Only
FIRST_YEAR
2006                 201
1994                 187
2010                 184
1993                 181
2008                 175

In [27]:
#Looks like 2006 is the winner for the year with the most first appearances by female characters. 
#Let's look at 2006 and see what alignment female characters had in their first appearance
align_ohsix = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.FIRST_YEAR != "2006"].index)
align_ohsix_count = align_ohsix["ALIGN"].value_counts()
print("Alignment of Female characters in the year 2006: ")
align_ohsix_count

Alignment of Female characters in the year 2006:

Good       100
Bad         40
ND          36
Neutral     25
Name: ALIGN, dtype: int64

In [28]:
#Let's remove the those 36 NDs just to clean the data up
fem_align_NDless = fem_firstmonth_year_NDless.drop(fem_firstmonth_year_NDless[fem_firstmonth_year_NDless.ALIGN == "ND"].index)
fem_align_ohsix = fem_align_NDless.drop(fem_align_NDless[fem_align_NDless.FIRST_YEAR != "2006"].index)
fem_align_ohsixyr = pd.crosstab(index = fem_align_ohsix["ALIGN"], columns = fem_align_ohsix["FIRST_YEAR"])
fem_align_count = fem_align_ohsix["ALIGN"].value_counts()
print("Alignment of Female characters in the year 2006: ")
fem_align_count

Alignment of Female characters in the year 2006:

Good       100
Bad         40
Neutral     25
Name: ALIGN, dtype: int64

In [26]:
#Thanks to Wendy Norris for providing some of the skeleton needed in the beginning for this project
#And also for helping me hash out the details when I ran into a problem!